<?php
/**
*  Team: RollRollTeam
*  Coding by 吕昆娴
*  后台主页设计
*/

/* @var $this yii\web\View */

$this->title = 'My Yii Application';
?>
<div class="site-index">
    <div class="logo">
        <img src="img/bk.jpg" alt=""/>
    </div>

    <div class="body-content">
    <h1>关于我们</h1>
        <div class="row">
            <div class="col-lg-4">
                <h2>许健</h2>

                <p>许健是一个快乐的朋友，总是笑容满面，生活充满了热情，并与他人分享。</p>
                <p>他的快乐会传染给他人，使他人的生活变得轻松，他友好的态度和热情，使他的朋友们感到快乐。</p>
                <p>愿许健永远快乐，并始终拥有他的热情。愿他的朋友们也感到快乐，因为他们有一个快乐的朋友。</p>
                <p>《许健的快乐》————阿娴</p>

            </div>
            <div class="col-lg-4">
                <h2>运开</h2>

                <p>运开是一个勇敢的朋友，喜欢冒险和探险，追求快乐，永不畏惧。</p>
                <p>我们一起踏上冒险之旅，探索未知的世界，经历各种有趣的事情，并彼此分享。</p>
                <p>愿运开永远勇敢，追寻快乐，不断冒险。</p>
                <p>愿我们三人的探险之旅永存，并永远傻乐，不要傻悲。</p>
                <p>《运开的冒险》————阿娴</p>

            </div>
            <div class="col-lg-4">
                <h2>吕昆娴</h2>

                <p>一个东北人从梦中醒来，倾听铁轨接缝与机械的撞击声。她会想到群山与雪原中的往返，越过驼鹿、野鸭、冬眠的熊和青蛙。</p>
                <p>河流从北而来，融化再凝结，挤压出静止中流动的褶皱。</p>
                <p>你要真实就给你真实，你要过去但不能活在过去，黑暗中，没人说话。</p>
                <p>云在远山之外，故事没有结尾，就这样，我们生活在星星上。</p>
                <p>《东北人阿娴》————阿娴</p>

            </div>
        </div>

    </div>
</div>
