-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2023-02-14 13:57:09
-- 服务器版本： 10.4.27-MariaDB
-- PHP 版本： 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `yii2022`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `password_reset_token` varchar(255) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT 10,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  `verification_token` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `admin`
--

INSERT INTO `admin` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `status`, `created_at`, `updated_at`, `verification_token`) VALUES
(2, 'xujian', 'oRugPokpxTJdcatyiSvmW_mnHgtN-Ic3', '$2y$10$EJ64ugc3YEnGH2jaM06XCO68igbTx4LpkcfVPnzoJHRy8Wm8h0Hti', 'jBk-evdhWk_2EdNng3IoZl9HlweAIG-z_1675768862', 'admin@admin.com', 10, 1669802492, 1675768862, 'Y0eD-EOv0Yl0HcOOpH_oDPsIpB_Rpo9q_1669802492');

-- --------------------------------------------------------

--
-- 表的结构 `air_force`
--

CREATE TABLE `air_force` (
  `Total aircraft` int(11) NOT NULL,
  `Total helicopters` int(11) NOT NULL,
  `Fighters` int(11) NOT NULL,
  `Dedicated attack` int(11) NOT NULL,
  `Attack helicopters` int(11) NOT NULL,
  `Trainers` int(11) NOT NULL,
  `Transport aircraft` int(11) NOT NULL,
  `Special-mission aircraft` int(11) NOT NULL,
  `Aerial tankers` int(11) NOT NULL,
  `country` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `air_force`
--

INSERT INTO `air_force` (`Total aircraft`, `Total helicopters`, `Fighters`, `Dedicated attack`, `Attack helicopters`, `Trainers`, `Transport aircraft`, `Special-mission aircraft`, `Aerial tankers`, `country`) VALUES
(4182, 1531, 773, 744, 537, 524, 444, 147, 19, 'Russia'),
(312, 113, 69, 28, 33, 71, 26, 5, 0, 'Ukraine');

-- --------------------------------------------------------

--
-- 表的结构 `help`
--

CREATE TABLE `help` (
  `hid` int(11) NOT NULL COMMENT '自增列',
  `country` varchar(64) NOT NULL COMMENT '援助俄罗斯还是乌克兰',
  `donator` varchar(256) NOT NULL COMMENT '援助方',
  `date` date NOT NULL COMMENT '援助时间',
  `kind` varchar(256) NOT NULL COMMENT '援助类型'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='军事援助表';

--
-- 转存表中的数据 `help`
--

INSERT INTO `help` (`hid`, `country`, `donator`, `date`, `kind`) VALUES
(1, 'Ukraine', 'Australia', '2022-03-01', 'Assistance'),
(2, 'Ukraine', 'Australia', '2022-04-08', 'Military Equipment'),
(3, 'Ukraine', 'Australia', '2022-07-04', 'Weapons and equipment'),
(4, 'Ukraine', 'Austria', '2022-02-25', 'Equipment'),
(5, 'Ukraine', 'Austria', '2022-11-01', 'Assistance and equipment'),
(6, 'Ukraine', 'Belgium', '2022-04-09', 'Assistance'),
(7, 'Ukraine', 'Belgium', '2022-08-25', 'Military Equipment'),
(8, 'Ukraine', 'Belgium', '2022-11-10', 'Grant'),
(9, 'Ukraine', 'Canada', '2022-06-28', 'Loan'),
(10, 'Ukraine', 'Canada', '2022-06-28', 'Assistance'),
(11, 'Ukraine', 'Canada', '2022-02-27', 'Military Equipment'),
(12, 'Ukraine', 'Canada', '2022-04-26', 'Weapons and equipment'),
(13, 'Ukraine', 'Canada', '2022-10-12', 'Weapons and equipment'),
(14, 'Ukraine', 'Cyprus', '2022-03-09', 'Equipment'),
(15, 'Ukraine', 'Czech Republic', '2022-02-26', 'Weapons and equipment'),
(16, 'Ukraine', 'Czech Republic', '2022-02-27', 'Weapons and equipment'),
(17, 'Ukraine', 'Canada', '2022-11-14', 'Grant'),
(18, 'Ukraine', 'Cyprus', '2022-03-09', 'Equipment'),
(19, 'Ukraine', 'Czech Republic', '2022-02-26', 'Weapons and equipment'),
(20, 'Ukraine', 'Czech Republic', '2022-02-27', 'Weapons and equipment'),
(21, 'Ukraine', 'Czech Republic', '2022-04-05', 'Weapons'),
(22, 'Ukraine', 'Czech Republic', '2022-11-16', 'Assistance ');

-- --------------------------------------------------------

--
-- 表的结构 `important`
--

CREATE TABLE `important` (
  `title` varchar(256) NOT NULL COMMENT '事件名称',
  `datetime` datetime NOT NULL COMMENT '事件日期与时间',
  `tid` int(11) NOT NULL COMMENT '自增列'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='重要事件表';

--
-- 转存表中的数据 `important`
--

INSERT INTO `important` (`title`, `datetime`, `tid`) VALUES
('俄罗斯针对不友好国家货车入境禁令开始生效', '2022-10-10 11:32:00', 1),
('普京将召开俄罗斯联邦安全会议', '2022-10-10 06:17:00', 2),
('俄称乌军炮击俄别尔哥罗德州四座村镇', '2022-10-09 12:39:00', 3),
('俄罗斯国防部：苏罗维金出任特别军事行动总指挥', '2022-10-08 20:13:00', 4),
('俄罗斯回应「北溪」泄漏初步调查结果，未参与调查，结果无法做到客观公正', '2022-10-07 12:00:00', 5),
('克宫称泽连斯基正试图挑起第三次世界大战，美英应为其言行负责', '2022-10-07 10:54:00', 6),
('泽连斯基呼吁北约先发制人打击俄罗斯', '2022-10-07 07:00:00', 7),
('俄方称尚未决定将特别军事行动改为反恐行动', '2022-10-05 21:59:00', 8),
('欧盟就新一轮对俄制裁达成协议', '2022-10-05 17:10:00', 9),
('顿涅茨克等四地区入俄条约正式生效', '2022-10-05 14:33:00', 10),
('俄外交部称「俄方完全遵守不可发生核战争的声明」', '2022-10-05 08:43:00', 11),
('美国宣布再为乌克兰提供 6.25 亿军援', '2022-10-05 00:48:00', 12),
('俄方回应泽连斯基拒绝与普京谈判', '2022-10-04 19:22:00', 13),
('乌总统泽连斯基签署不与俄总统普京谈判的决定', '2022-10-04 16:35:00', 14),
('俄联邦委员会全票批准顿涅茨克等四地入俄条约', '2022-10-04 15:47:00', 15),
('乌克兰议长称乌计划-底前开始欧盟成员资格谈判', '2022-10-04 07:46:00', 16),
('立陶宛宣布驱逐俄罗斯驻立陶宛临时代办', '2022-10-03 18:41:00', 17),
('俄国家杜马通过顿涅茨克等四地「入俄」相关法律草案', '2022-10-03 18:27:00', 18),
('俄媒：普京已向俄国家杜马提交顿涅茨克等四地「入俄」相关法律草案', '2022-10-03 09:15:00', 19),
('俄罗斯空天军在红利曼方向对乌军进行空中打击', '2022-10-03 06:46:00', 20),
('俄罗斯宪法法院批准四地加入俄罗斯的条约文件', '2022-10-02 18:06:00', 21),
('俄军和顿巴斯武装已从红利曼撤退', '2022-10-01 22:10:00', 22),
('俄宪法法院已受理总统普京关于「四地入俄」的审查请求', '2022-10-01 19:47:00', 23),
('乌克兰宣布对普京亲属在内的俄数千名个人和实体实施制裁', '2022-10-01 17:26:00', 24),
('俄媒：泽连斯基声称「不会再与普京和谈」', '2022-10-01 13:41:00', 25),
('联合国安理会就反对乌东四地公投的决议草案投票', '2022-10-01 03:22:00', 26),
('美国对俄罗斯数百名个人和实体实施全面制裁', '2022-09-30 23:06:00', 27),
('乌克兰签署加入北约申请', '2022-09-30 22:34:00', 28),
('普京签署顿涅茨克等四地加入俄罗斯的条约', '2022-09-30 20:51:00', 29),
('普京称苏联已不复存在，俄罗斯不寻求恢复苏联', '2022-09-30 20:50:00', 30),
('克宫称「入俄」后，袭击顿涅茨克等四地将被视为「侵略俄罗斯」', '2022-09-30 18:01:00', 31),
('拜登表示美国永远不会承认俄罗斯「占据乌克兰领土」的行为', '2022-09-30 11:01:00', 32),
('普京签署法令，承认赫尔松和扎波罗热两地「独立」', '2022-09-30 08:14:00', 33),
('俄媒称新领土入俄条约签署仪式 30  举行，普京将出席', '2022-09-29 18:49:00', 34),
('美国宣布向乌克兰提供价值 11 亿美元军事援助', '2022-09-29 01:11:00', 35),
('欧盟宣布第八轮对俄制裁措施，全面禁止俄商品在欧盟市场销售', '2022-09-28 22:09:00', 36),
('中方回应四地「入俄公投」结果：各国的主权领土完整都应该得到尊重', '2022-09-28 15:45:00', 37),
('佩斯科夫：普京表示仍愿与乌克兰进行会谈', '2022-09-28 06:57:00', 38),
('顿涅茨克等四地入俄公投结果公布', '2022-09-28 05:46:00', 39),
('安理会就乌东四地公投召开紧急会议，外交部回应「一切有利于和平解决危机的努力都应该得到支持」', '2022-09-27 15:55:00', 40),
('美同意援助乌克兰近 120 亿美元', '2022-09-27 08:51:00', 41),
('俄称导弹击中一外国雇佣军临时据点消灭 300 多人，乌称在多地反击', '2022-09-25 07:30:00', 42),
('俄外长：西方国家已经参加乌克兰冲突', '2022-09-25 07:00:00', 43),
('俄国防部副部长换人', '2022-09-25 00:00:00', 44),
('普京签署包括对主动投降、逃兵和不响应征兵令者处罚的一系列动员相关的法律', '2022-09-24 21:02:00', 45),
('俄国防部发布部分动员令执行情况，堪察加地区的被征召者列队领取武器', '2022-09-24 18:00:00', 46),
('乌克兰四地今天开始「入俄投票」，「公投」地区面积大约占乌领土 15%', '2022-09-23 05:54:00', 47),
('俄称打击顿涅茨克地区等地乌方目标', '2022-09-22 10:10:00', 48),
('俄媒：泽连斯基在联大讲话中排除了与俄罗斯进行和平谈判可能性', '2022-09-22 09:25:00', 49),
('普京称俄罗斯在领土完整受到威胁时将使用一切可用的手段', '2022-09-21 14:49:00', 50),
('普京宣布支持顿巴斯等地区公投', '2022-09-21 14:31:00', 51),
('普京发表全国演讲，宣布俄罗斯进行部分动员', '2022-09-21 14:17:00', 52),
('乌克兰四个地区将于 9 - 23  开始进行公投入俄，泽连斯基表态', '2022-09-21 09:56:00', 53),
('俄媒：卢甘斯克和顿涅茨克加入俄罗斯全民公投将于 23  至 27  举行', '2022-09-20 21:59:00', 54),
('乌克兰称在东北部一处集体墓地发现数百具尸体', '2022-09-18 00:02:00', 55),
('普京会见印度总理时表示，俄罗斯将尽一切努力尽快结束在乌克兰的冲突', '2022-09-17 09:56:00', 56),
('乌称击退俄军多次进攻，控制了哈尔科夫州几乎全境', '2022-09-17 06:43:00', 57),
('俄方痛斥乌「安全保障草案」称这是第三次世界大战的前奏', '2022-09-14 10:56:00', 58),
('乌总统办公室发布乌克兰安全保障协议草案', '2022-09-13 10:51:00', 59),
('泽连斯基称 9 -初至今乌军已控制东部和南部 6000 平方公里土地', '2022-09-13 07:26:00', 60),
('基辅欢呼「夺回领土」，俄军解释「重新部署」', '2022-09-13 06:14:00', 61),
('俄乌双方公布最新战况，乌军称在哈尔科夫向南东北三方推进', '2022-09-12 02:56:00', 62),
('由于炮击导致核电站涡轮机和反应堆运行不稳定，有发生事故的可能，扎波罗热核电站停止运转', '2022-09-11 22:00:00', 63),
('俄媒：拉夫罗夫称俄不拒绝与乌谈判', '2022-09-11 21:14:00', 64),
('乌总理称乌克兰直接损失高达 3260 亿美元，喊话盟友「尽快结束这场战争」', '2022-09-05 00:00:00', 65),
('乌克兰基辅州 25  发生爆炸，相关部门正在开展救援行动', '2022-08-25 13:35:00', 66),
('美国国防部宣布再向乌克兰提供约 30 亿美元军事援助，为美国目前向乌提供的最大一笔军事援助', '2022-08-25 09:35:00', 67),
('马克龙又表态称欧盟准备「长期」支持乌克兰', '2022-08-23 20:46:00', 68),
('冲突以来首次，英、法、德等欧洲六国7-未向乌提供新军援承诺', '2022-08-18 19:26:00', 69),
('乌克兰将战时状态和总动员令延长至 11 - 21  ', '2022-08-15 21:20:00', 70),
('乌克兰总统向议会提交关于延长战时状态和总动员令的法案草案', '2022-08-12 10:45:00', 71),
('俄方称俄黑海舰队基地遭乌方无人机袭击', '2022-07-31 00:00:00', 72),
('俄方披露乌克兰在北约指导下策划劫持俄罗斯军机，这一行动被俄方破坏', '2022-07-25 22:33:00', 73),
('7 月 23 日 美国国会代表团访问乌克兰基辅', '2022-07-24 06:12:00', 74),
('俄乌今将在土耳其签署乌粮食出口协议，联合国秘书长也将出席', '2022-07-22 11:57:00', 75),
('叙利亚宣布同乌克兰断交', '2022-07-20 14:10:00', 76),
('欧盟拟对俄罗斯实施第七轮制裁，多国担忧新制裁加剧能源危机', '2022-07-15 09:29:00', 77),
('乌克兰外交部宣布中断与朝鲜的外交关系', '2022-07-14 00:45:00', 78),
('朝鲜承认顿涅茨克和卢甘斯克独立', '2022-07-13 22:30:00', 79),
('德国国务秘书称德国将停止从俄罗斯进口煤炭和石油', '2022-07-13 21:32:00', 80),
('乌克兰国家安全局网站疑遭黑客攻击，已无法登录', '2022-07-12 02:03:00', 81),
('俄乌在哈尔科夫展开激战', '2022-07-12 00:26:00', 82),
('乌克兰总统泽连斯基解除该国多名驻外大使职务', '2022-07-10 08:21:00', 83),
('美国国会报告承认「乌军持续作战能力正在快速下降」，加大军援无法解决乌军困境', '2022-07-04 18:00:00', 84),
('7 月 3 日 泽连斯基确认乌军从利西昌斯克撤出', '2022-07-04 15:34:00', 85),
('俄罗斯宣布「解放」卢甘斯克地区', '2022-07-04 12:35:00', 86),
('俄外交部称北约明确宣布与俄对抗，俄军总参谋长格拉西莫夫赴特别军事行动前线视察', '2022-07-03 00:00:00', 87),
('美国防部向乌提供 8.2 亿美元额外军事援助，乌方称目前泽连斯基和普 京没有会晤计划', '2022-07-02 02:00:00', 88),
('俄国防部宣布从蛇岛撤军️', '2022-06-30 16:42:00', 89),
('俄乌进行冲突以来最大规模战俘交换：95名亚速钢铁厂守军获释', '2022-06-30 15:13:00', 90),
('乌克兰总统泽连斯基宣布中断与叙利亚的外交关系', '2022-06-30 03:00:00', 91),
('乌称一购物中心遭袭已致 13 死 59 伤，俄辟谣称「该处实际被用于存放军事设备」', '2022-06-27 22:47:00', 92),
('乌方称基辅和基辅州遭大约 14 枚导弹打击', '2022-06-26 14:28:00', 93),
('乌克兰高官声称不再寻求加入北约', '2022-06-26 09:15:00', 94),
('俄称已完全控制北顿涅茨克，乌国防部称乌军将继续战斗', '2022-06-26 07:03:00', 95),
('英媒发现：俄议员警告若第三次世界大战爆发，「伦敦会首先被轰炸」', '2022-06-25 22:07:00', 96),
('俄军称击退乌军对蛇岛进攻，乌军攻击俄在黑海海域天然气设施', '2022-06-22 07:00:00', 97),
('俄军用巡航导弹打击乌军指挥所，乌方称前线局势艰难但局势仍在掌控中', '2022-06-20 04:48:00', 98),
('俄乌谈判乌方代表团团长：可能在 8 -底恢复谈判', '2022-06-18 17:01:00', 99),
('俄国防部称「一天消灭乌军 550 多人，摧毁『亚速营』指挥部」', '2022-06-17 20:00:00', 100),
('泽连斯基与德法意罗领导人举行会谈，朔尔茨称泽连斯基将出席七国集团峰会', '2022-06-16 19:38:00', 101),
('乌克兰几乎全境陆续响起防空警报，进入防空紧急状态', '2022-06-16 16:06:00', 102),
('据媒体报道，德、意、法三国领导人已进入乌克兰', '2022-06-16 14:51:00', 103),
('德法意三国领导人已抵达乌克兰，俄方表示「或无助于解决当前局势」', '2022-06-16 13:52:00', 104),
('泽连斯基签署制裁普京的总统令', '2022-06-09 23:10:00', 105),
('俄开出普京与泽连斯基会晤条件，称需两国谈判进程恢复', '2022-06-08 18:50:00', 106),
('扎波罗热地区军民政府：加入俄罗斯联邦的全民公投将于今-举行', '2022-06-08 16:32:00', 107),
('泽连斯基称，乌克兰将暂停出口天然气和煤炭以满足国内供应', '2022-06-08 08:30:00', 108),
('俄防长称俄军已控制顿涅茨克等地区', '2022-06-07 18:18:00', 109),
('俄罗斯库尔斯克州一村庄再遭乌军炮击，乌克兰暂未回应', '2022-06-06 16:02:00', 110),
('乌克兰基辅传出巨大爆炸声，乌全境拉响防空警报', '2022-06-05 11:50:00', 111),
('俄罗斯公布第三阶段军事行动目标，包括控制尼古拉耶夫州、敖德萨州和哈尔科夫州', '2022-06-03 22:30:00', 112),
('泽连斯基：俄已控制乌近五分之一领土', '2022-06-03 07:36:00', 113),
('欧盟正式批准第六轮对俄制裁', '2022-06-02 22:30:00', 114),
('泽连斯基：乌克兰面临形势非常困难，每 阵亡乌士兵 60-100 人', '2022-06-01 23:09:00', 115),
('乌克兰赫尔松州宣布计划于近期加入俄联邦', '2022-05-31 22:08:00', 116),
('乌方：俄军攻入北顿涅茨克市中心', '2022-05-31 01:06:00', 117),
('普京警告法德勿向乌克兰提供重型武器', '2022-05-29 12:53:00', 118),
('俄国防部称「已完全控制顿涅茨克地区战略重镇红利曼」', '2022-05-29 09:00:00', 119),
('泽连斯基表示「反对任何乌克兰加入欧盟的替代方案」', '2022-05-29 00:00:00', 120),
('俄军再发射铝热燃烧弹：漫天火雨', '2022-05-28 08:52:00', 121),
('泽连斯基：顿巴斯地区战局极其艰难', '2022-05-28 06:51:00', 122),
('乌副防长：顿巴斯地区战斗已达最高烈度', '2022-05-27 07:14:00', 123),
('乌情报总局局长称普京两个-前曾遭暗杀', '2022-05-24 10:24:00', 124),
('俄乌冲突 90 天：僵局持续，1400 万人流离失所', '2022-05-24 07:45:00', 125),
('泽连斯基：已准备好与普京会面并且将只讨论停战问题', '2022-05-24 04:05:00', 126),
('美国防部否认制定摧毁俄罗斯黑海舰队的计划', '2022-05-21 10:09:00', 127),
('亚速营指挥官手缠绷带宣布投降', '2022-05-21 08:30:00', 128),
('俄国防部：已完全控制亚速钢铁厂，共有2439名乌武装人员投降', '2022-05-21 02:56:00', 129),
('芬兰能源供应商表示，俄罗斯已通知其 5 - 21  开始停止对芬兰的天然 气供应', '2022-05-20 22:35:00', 130),
('美媒：乌克兰法院已批准逮捕前总统，指控后者涉嫌将至少 20 人偷运至俄罗斯', '2022-05-20 19:13:00', 131),
('俄军第五代战机苏-57 已参加在乌克兰的特别军事行动', '2022-05-20 11:05:00', 132),
('亚速营副指挥官否认已投降，称「军事行动仍在继续」', '2022-05-20 09:50:00', 133),
('美国参议院通过约 400 亿美元的乌克兰援助法案', '2022-05-20 00:00:00', 134),
('俄方在亚速钢铁厂内发现乌军遗留的「孙子兵法」', '2022-05-19 19:52:00', 135),
('俄在乌发现可喷洒药剂的无人机', '2022-05-19 13:40:00', 136),
('俄方称亚速钢铁厂已有 959 名乌方人员投降', '2022-05-18 17:52:00', 137),
('俄乌同时宣布和平谈判「无限期暂停」，责任在于对方', '2022-05-18 10:30:00', 138),
('俄罗斯外交部：乌克兰方面事实上退出了俄乌谈判', '2022-05-17 17:14:00', 139),
('乌方将马里乌波尔控制权移交俄方', '2022-05-17 13:28:00', 140),
('俄罗斯载有「可携核弹头导弹系统」的发射车正向芬兰边境行驶', '2022-05-17 12:48:00', 141),
('普京称「芬兰瑞典加入北约不构成直接威胁」', '2022-05-17 07:00:00', 142),
('美驻乌使馆称「美国军援乌克兰几乎所有榴弹炮已部署到位」', '2022-05-16 03:27:00', 143),
('俄方称美国正试图诱降俄外交官', '2022-05-15 15:06:00', 144),
('俄国防部称俄火箭和炮兵部队击毁乌军 543 个集中区', '2022-05-14 17:45:00', 145),
('俄美防长自俄乌冲突以来首次通电话', '2022-05-14 04:19:00', 146),
('泽连斯基称准备与普京直接会谈，但乌克兰不准备为结束战争在主权问题上做出任何让步', '2022-05-13 22:55:00', 147),
('乌克兰政府通过一项文件决定将乌境内俄罗斯资产充公', '2022-05-11 18:18:00', 148),
('第一批乌克兰士兵抵达德国军事基地，将接受武器操作训练', '2022-05-11 16:40:00', 149),
('乌克兰宣布停止接收来自俄罗斯罗斯托夫州的天然气', '2022-05-11 08:00:00', 150),
('媒体称「乌海军副司令遭俄军导弹击中身亡」', '2022-05-10 17:09:00', 151),
('俄国防部称「挫败乌克兰夺取蛇岛企图」', '2022-05-10 07:00:00', 152),
('欧盟委员会主席：乌克兰总统泽连斯基递交了加入欧盟的文件', '2022-05-09 20:00:00', 153),
('英国宣布对俄新制裁，大幅提高铂和钯等贵金属进口关税', '2022-05-09 09:00:00', 154),
('当地时间 8  加拿大总理特鲁多到访乌克兰', '2022-05-08 22:40:00', 155),
('美国第一夫人吉尔·拜登秘密到访乌克兰', '2022-05-08 22:30:00', 156),
('美国施压希腊向乌克兰移交俄制武器', '2022-05-08 20:32:00', 157),
('俄乌蛇岛争夺战中，双方均声称「对方损失惨重」', '2022-05-08 13:46:00', 158),
('乌高官称乌克兰将没收提倡暴力或杀害乌克兰人、歌颂俄罗斯军队等的俄罗斯文学作品', '2022-05-08 02:23:00', 159),
('俄军事记者称「俄军与亚速钢铁厂守军首次进行面对面接触」', '2022-05-07 19:00:00', 160),
('联合国安理会通过涉乌克兰局势声明，称对维护乌克兰的和平与安全深表关切', '2022-05-07 03:31:00', 161),
('乌军称击退俄军在卢甘斯克的进攻', '2022-05-06 06:32:00', 162),
('5 月 5 日 乌方称俄罗斯军队已攻入亚速钢铁厂，俄国防部将连续三天开放人道主义走廊', '2022-05-05 01:00:00', 163),
('媒体：泽连斯基顾问称乌军将在 6 -中旬前发起反攻', '2022-05-04 10:40:00', 164),
('5 月 3 日 乌克兰多地遭到攻击，中部和西部 6 个火车站遭到攻击，利 沃夫发生爆炸全城停电', '2022-05-04 07:20:00', 165),
('泽连斯基称「恢复领土完整是乌克兰的最终目标」', '2022-05-04 07:06:00', 166),
('普京发布经贸领域反制措施', '2022-05-03 23:26:00', 167),
('外媒：普京可能在 5 - 9  胜利 对乌克兰「正式宣战」', '2022-05-03 15:30:00', 168),
('俄罗斯国防部宣布，将用导弹打击敖德萨附近军用机场', '2022-05-02 08:47:00', 169),
('乌军否认基辅幽灵已战死，称「基辅幽灵是泛指所有乌克兰飞行员」', '2022-05-01 23:04:00', 170),
('普京下令在俄各部门设立 IT 安全部门', '2022-05-01 21:21:00', 171),
('乌克兰飞行员「基辅幽灵」被证实已死亡，他曾被传击落多达 40 架俄罗斯飞机', '2022-05-01 19:00:00', 172),
('乌克兰总统官方账号发布消息称，泽连斯基在基辅会见到访的美国会众议院议长佩洛西', '2022-05-01 14:00:00', 173),
('俄外交部官员称「俄美战略稳定对话已冻结」', '2022-05-01 13:15:00', 174),
('4 月 30 日 俄军称使用高精度武器打击了乌克兰 17 处军事设施，乌称 俄在东部加大攻势', '2022-05-01 06:43:00', 175),
('俄媒称「俄已确定退出国际空间站 期」', '2022-04-30 18:55:00', 176),
('德国拒绝以卢布支付俄罗斯天然气，德财长称「不会被勒索」', '2022-04-30 18:41:00', 177),
('美国防部称「美国正在德国训练乌克兰武装部队」', '2022-04-30 02:56:00', 178),
('拜登要求国会追加 330 亿美元对乌援助', '2022-04-29 10:12:00', 179),
('5 月 1 日 起乌克兰赫尔松州将卢布作为流通货币使用', '2022-04-28 12:00:00', 180),
('普京称外部势力干涉乌局势将遭闪电般打击', '2022-04-28 08:21:00', 181),
('联合国秘书长抵达乌克兰', '2022-04-28 00:59:00', 182),
('英国取消对乌克兰商品所有关税', '2022-04-26 11:19:00', 183);

-- --------------------------------------------------------

--
-- 表的结构 `land_power`
--

CREATE TABLE `land_power` (
  `Armored vehicles` int(11) NOT NULL,
  `Tank strength` int(11) NOT NULL,
  `Tower artillery` int(11) NOT NULL,
  `Self-propelled artillery` int(11) NOT NULL,
  `Mobile rocket projectors` int(11) NOT NULL,
  `country` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `land_power`
--

INSERT INTO `land_power` (`Armored vehicles`, `Tank strength`, `Tower artillery`, `Self-propelled artillery`, `Mobile rocket projectors`, `country`) VALUES
(151641, 12566, 4336, 6575, 3887, 'Russia'),
(37000, 1890, 889, 953, 647, 'Ukraine');

-- --------------------------------------------------------

--
-- 表的结构 `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1669802274),
('m130524_201442_init', 1669802277),
('m190124_110200_add_verification_token_column_to_user_table', 1669802277);

-- --------------------------------------------------------

--
-- 表的结构 `military_comparison`
--

CREATE TABLE `military_comparison` (
  `country` varchar(255) NOT NULL COMMENT '俄乌',
  `indicator` varchar(255) NOT NULL COMMENT '指标（海陆空、核弹）',
  `count` int(11) NOT NULL COMMENT '数量',
  `millions_capita` int(11) NOT NULL COMMENT '百万人均拥有量'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='俄乌军事对比';

--
-- 转存表中的数据 `military_comparison`
--

INSERT INTO `military_comparison` (`country`, `indicator`, `count`, `millions_capita`) VALUES
('Russia', 'Air force', 4182, 29),
('Russia', 'Land power', 151641, 1036),
('Russia', 'Naval force', 598, 4),
('Russia', 'Nuclear weapons', 5977, 41),
('Russia', 'Personnel', 1330900, 9091),
('Ukraine', 'Air force', 312, 8),
('Ukraine', 'Land power', 37000, 902),
('Ukraine', 'Naval force', 38, 1),
('Ukraine', 'Nuclear weapons', 0, 0),
('Ukraine', 'Personnel', 500000, 12195);

-- --------------------------------------------------------

--
-- 表的结构 `naval_force`
--

CREATE TABLE `naval_force` (
  `Total military ships` int(11) NOT NULL,
  `Corvettes` int(11) NOT NULL,
  `Submarines` int(11) NOT NULL,
  `Patrol vessels` int(11) NOT NULL,
  `Mine warfare` int(11) NOT NULL,
  `Destroyers` int(11) NOT NULL,
  `Frigates` int(11) NOT NULL,
  `Aircraft carriers` int(11) NOT NULL,
  `country` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `naval_force`
--

INSERT INTO `naval_force` (`Total military ships`, `Corvettes`, `Submarines`, `Patrol vessels`, `Mine warfare`, `Destroyers`, `Frigates`, `Aircraft carriers`, `country`) VALUES
(598, 86, 70, 59, 49, 15, 11, 1, 'Russia'),
(38, 1, 0, 13, 1, 0, 1, 0, 'Ukraine');

-- --------------------------------------------------------

--
-- 表的结构 `news`
--

CREATE TABLE `news` (
  `nid` int(11) NOT NULL COMMENT '自增列',
  `content` varchar(255) NOT NULL COMMENT '新闻简介',
  `title` varchar(255) NOT NULL COMMENT '新闻标题',
  `url` varchar(255) NOT NULL COMMENT '新闻链接'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='战争新闻';

--
-- 转存表中的数据 `news`
--

INSERT INTO `news` (`nid`, `content`, `title`, `url`) VALUES
(1, '虽然中国在经济上跟俄罗斯的合作确实越来越紧密；但在军事方面，中国迄今为止，依然坚持不向俄罗斯出售军火。', '俄乌战争——中国为什么始终没有支持俄罗斯？', 'https://www.163.com/dy/article/HJ5FAFRI05238404.html'),
(2, '俄乌局势传来大消息，俄罗斯外交部副部长韦尔希宁在接受采访时表示，俄罗斯已准备好与乌克兰进行无条件谈判。', '俄最新发声：准备与乌方无条件谈判 泽连斯基赴欧盟要武器求生存', 'https://www.163.com/dy/article/HTDJ7NES05159GSR.html'),
(3, '在俄罗斯对乌克兰发动军事进攻一周年之际，俄罗斯抛出了“无条件谈判”论。当地时间2月11日，俄罗斯外交部副部长韦尔希宁在接受俄媒采访时表示，俄罗斯已准备好与乌克兰进行无条件谈判。', '俄乌战争开战一周年，俄首提“无条件谈判”？你信吗？', 'https://www.163.com/dy/article/HTCDEBNQ0513009F.html'),
(4, '近日，俄副总理诺瓦克表示，中俄第二条跨境天然气管道“西伯利亚力量2号”是两国如今合作的主要项目，目前双方正在开展相关的商业谈判。俄乌战争天天烧钱，曾经以天然气出口为主要经济支柱的俄罗斯，现在将目光转向我国，也是预料之中的事情。那么我们国家每年要消耗多少天然气？俄罗斯多的用不完，以前为什么不多卖给我们一些？为什么在这个时候又主动想合作呢？今天我们就一起来聊一聊中俄能源合作的那些事儿。', '中俄第二条能源生命线，俄罗斯受战争影响，会给我们一些折扣吗？', 'https://new.qq.com/rain/a/20230210A06PMN00'),
(5, '2月24日爆发的俄乌战争，如今打到第10个月。这场战争打成什么样了，期间经历了什么，如何走到今天的？今天帮大家梳理一下，给出一个清晰的交代。', '图解俄乌战争10个月进程，以及何时终结', 'https://new.qq.com/rain/a/20221128A03GAG00'),
(6, '俄乌冲突爆发即将一周年，目前不仅没有止战的趋势，双方还在调集力量作战事升级的准备。俄罗斯总统普京不久前在纪念斯大林格勒战役80周年讲话中，批评德国向乌克兰提供“豹2”坦克。乌克兰方面称，俄罗斯可能会在2月24日开战一周年前后开启新一轮重大攻势。对于俄乌冲突的形势，国内有两种不同的观点，一种观点认为当前俄军占有优势，将在乌东取得明显进展；另一种观点认为，因为美欧加大了对乌军援力度，胜利天平开始倾向于乌方。', '俄乌或将在顿巴斯地区形成新的均势', 'https://finance.sina.com.cn/jjxw/2023-02-12/doc-imyfmxxs9477299.shtml'),
(7, '泽连斯基对外表示，俄乌冲突就是乌克兰发动的。这是美国掩盖了一年的真相，这是美国说了一年的谎言。当然，泽连斯基没有明说他发动了俄乌冲突，但泽连斯基透露了一个惊天阴谋，乌克兰故意不遵守《明斯克协议》。', '泽连斯基不打自招：乌克兰发动俄乌冲突？戳穿美国掩盖一年的谎言', 'https://www.sohu.com/a/639795261_793025'),
(8, '最新消息显示，在俄乌冲突爆发一周年即将到来之际，白宫宣布，拜登将于2月20日至22日访问波兰。', '拜登面具被乌克兰撕下，俄乌冲突首个交战安全区正建立，和平有望', 'https://new.qq.com/rain/a/20230212A02G8400'),
(9, '不同于美国几次发动局部冲突时的“恃强凌弱”，俄乌冲突交战双方的实力差距没那么悬殊，再加上俄罗斯、乌克兰和北约投入了大量先进武器装备，因此这次“冷战后规模最大、持续时间最长的局部冲突”也被全球军事界看作是最新军事战略和武器装备的“试金石”。时值俄乌冲突爆发临近一周年，《环球时报》策划了“影响俄乌冲突进程的关键装备”系列报道。', '“影响俄乌冲突进程的关键装备”系列之一：谁在主宰乌克兰天空？', 'https://www.sohu.com/a/639417455_162522'),
(10, '自2月份以来，德国等多个国家陆续做出突破性决定，宣布为乌克兰提供坦克。据悉，德国准备在最近数月将坦克送至乌克兰，预计乌克兰可以获得数百辆来自西方的坦克。与此同时，随着西方不断加大援乌力度，俄乌冲突将会持续升级，或将迎来终局。', '俄乌冲突迎来终局？卡德罗夫给出重要时间节点，联合国感到不安', 'https://www.163.com/dy/article/HTD97IHM0534NABM.html'),
(11, '新华社北京5月15日电 在世界正在经历的百年未有之大变局中，俄乌冲突无疑是一个重大事件，也是一个重要节点。这是因为：冲突的根源不在俄乌之间，而在俄美之间；冲突的本质不在俄乌对抗，而在俄美角力；冲突的影响不局限于俄乌两国，而是波及全球。围绕这场冲突所引发的“世界冲击波”，新华社近日连续播发5篇文章，从国际秩序、全球安全、世界经济、美元霸权和科学合作五个维度一一进行了深入解析。', '五个维度解析俄乌冲突之“世界冲击波”', 'http://www.news.cn/world/2022-05/15/c_1211647247.htm'),
(12, '美国一直是指导、协调并策划西方社会支持乌克兰的关键力量。然而将乌克兰和美国的利益画等号是错误的。美国保留着决定自身目标的自由，同时继续在口头上支持乌克兰的政治诉求。不过华盛顿正在认真分析可以启动谈判的恰当时机。美国军方领导层的代表正越来越多地谈论通过外交努力化解冲突的必要性。', '俄媒分析美为何想延长俄乌冲突：不只是为遏制俄罗斯', 'http://www.news.cn/mil/2023-02/10/c_1211727300.htm'),
(13, '美国总统拜登证实，在俄乌冲突爆发一周年之际，他正考虑对波兰进行访问，但不会到访乌克兰。', '拜登发声：俄乌冲突爆发一周年之际，他考虑访问波兰但不会去乌克兰', 'https://news.ifeng.com/c/8NHpLNZ134y'),
(14, '在19日当天，短短24小时之内，围绕俄乌冲突接连传出3条消息，引起舆论广泛热议。', '24小时内3条消息，2023年俄乌冲突或更血腥，中方指出最敏感问题', 'https://www.163.com/dy/article/HRKOCUNL0553953W.html'),
(15, '自2021年年底以来，俄罗斯与乌克兰之间局势日益紧张。以下是这场危机的来龙去脉。', '乌克兰俄罗斯冲突始末来龙去脉 俄罗斯乌克兰冲突原因及背景！', 'https://new.qq.com/rain/a/20220224A07MCT00'),
(16, '欧盟轮值主席国瑞典3日晚宣布，欧盟成员国代表当天就俄罗斯石油产品价格上限达成一致。', '欧盟就设定俄罗斯石油产品价格上限达成一致', 'http://www.news.cn/world/dgwj/wkljs/index.htm'),
(17, '自2月24日俄乌冲突全面爆发以来，以美国为首的西方国家在经济、金融、能源等多个领域对俄罗斯实施了前所未有的广泛制裁，而乌克兰则获得了巨额的军事、经济和人道主义援助。与此同时，俄乌冲突的“冲击波”已传遍全球，世界正面临多重挑战。6月24日，这场冲突迎来4个月的时间节点，各个利益攸关方究竟得失几何？', '持续追踪｜俄乌冲突4个月，各方得失几何？', 'https://www.thepaper.cn/newsDetail_forward_18710656'),
(18, '俄乌冲突已经延续到了第335天，根据俄罗斯国防部的最新消息，俄军对乌克兰特别军事行动总指挥格拉西莫夫表示，俄军将会在赫尔松和扎波罗热地区组建三个摩托化步兵师，并在卡累利阿西北部地区组建一个军团，其目的不言自明，欧盟想要俄罗斯撤军的目标已经不可能完成，俄乌冲突正在因为西方继续向乌克兰支援重型武器装备，以及俄军想要全面拿下东乌关键地区而逐步升级。', '俄乌冲突再打下去，只有三种结局', 'https://www.sohu.com/a/634139996_352347'),
(19, '2022年2月24日基辅时间凌晨4时，俄罗斯的炮火从四面八方向乌克兰全境倾泻而下，二战以来欧洲大陆上最严酷的战争拉开帷幕，至今已整整十个月。', '俄乌冲突10个月：冰冷数字背后，战争的残酷代价 | 智识Scholar第21期', 'https://www.sohu.com/a/620712275_121425542'),
(20, '2022年，乌克兰危机牵动人心。乌克兰危机升级源于美西方在地缘政治领域对俄罗斯不断施压、步步紧逼，是双方长期积累的矛盾爆发的结果。自2022年2月24日，俄罗斯对乌克兰展开“特别军事行动”以来，已经过去300余天。12月29日，乌克兰全境又遭大规模导弹袭击，这场“21世纪以来欧洲最大规模军事冲突”的烈度和持续时间将更加难以预料。在烽烟漫天、生灵涂炭、家园毁灭的背后，西方军工企业收获大量订单，赚的盆满钵满。', '2022年度图片｜俄乌冲突：战火悲歌', 'https://www.163.com/dy/article/HPTGGQ2O0514R9P4.html');

-- --------------------------------------------------------

--
-- 表的结构 `personnel`
--

CREATE TABLE `personnel` (
  `total` int(11) NOT NULL COMMENT 'Estimated total military personnel',
  `Active soldiers` int(11) NOT NULL,
  `Reserve forces` int(11) NOT NULL,
  `Paramilitary units` int(11) NOT NULL,
  `country` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='Estimated military personnel';

--
-- 转存表中的数据 `personnel`
--

INSERT INTO `personnel` (`total`, `Active soldiers`, `Reserve forces`, `Paramilitary units`, `country`) VALUES
(1330900, 830900, 250000, 250000, 'Russia'),
(500000, 200000, 250000, 50000, 'Ukraine');

-- --------------------------------------------------------

--
-- 表的结构 `team`
--

CREATE TABLE `team` (
  `name` varchar(255) NOT NULL,
  `stu_number` int(11) NOT NULL,
  `introduce` varchar(2000) NOT NULL,
  `pictures` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `team`
--

INSERT INTO `team` (`name`, `stu_number`, `introduce`, `pictures`) VALUES
('卷卷卷小分队', 1, 'hhhh', ''),
('运开', 2012619, '热爱计算机与网安技术的预备程序员，菜且自知', ''),
('许健', 2013018, '大三网安专业的咸鱼，梦想有一天成为技术卓越的大佬。', ''),
('吕昆娴', 2013851, '吕昆娴，来自吉林通化，最先介绍这个因为最喜欢的标签是东北人。\r\n现在就读于南开大学网络空间安全学院信息安全专业，成绩平平，偶尔崩溃，常常苦恼，总是热爱，但对技术依然抱有好奇和热情，也希望自己永远不失去这种坚强和勇气。\r\n被朋友们评价为外向开朗，因为爱笑、乐观，也比较有趣。最大的问题是心里素质极差。\r\n最近读了余华的一本书叫《第七天》，分享一句最喜欢的话来凑满自我介绍的字数：我在情感上的愚钝就像是门窗紧闭的屋子，虽然爱情的脚步在屋前走过去又走过来，我也听到了，可我觉得那是路过的脚步，那是走向别人的脚步。直到有一天，这个脚步停留在这里，然后门铃响了。', '');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `password_reset_token` varchar(255) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT 10,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  `verification_token` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `status`, `created_at`, `updated_at`, `verification_token`) VALUES
(2, 'admin', 'oRugPokpxTJdcatyiSvmW_mnHgtN-Ic3', '$2y$10$EJ64ugc3YEnGH2jaM06XCO68igbTx4LpkcfVPnzoJHRy8Wm8h0Hti', 'jBk-evdhWk_2EdNng3IoZl9HlweAIG-z_1675768862', 'admin@admin.com', 10, 1669802492, 1675768862, 'Y0eD-EOv0Yl0HcOOpH_oDPsIpB_Rpo9q_1669802492');

--
-- 转储表的索引
--

--
-- 表的索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `password_reset_token` (`password_reset_token`);

--
-- 表的索引 `air_force`
--
ALTER TABLE `air_force`
  ADD PRIMARY KEY (`country`);

--
-- 表的索引 `help`
--
ALTER TABLE `help`
  ADD PRIMARY KEY (`hid`);

--
-- 表的索引 `important`
--
ALTER TABLE `important`
  ADD PRIMARY KEY (`tid`);

--
-- 表的索引 `land_power`
--
ALTER TABLE `land_power`
  ADD PRIMARY KEY (`country`);

--
-- 表的索引 `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`);

--
-- 表的索引 `military_comparison`
--
ALTER TABLE `military_comparison`
  ADD PRIMARY KEY (`country`,`indicator`,`count`,`millions_capita`);

--
-- 表的索引 `naval_force`
--
ALTER TABLE `naval_force`
  ADD PRIMARY KEY (`country`);

--
-- 表的索引 `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`nid`);

--
-- 表的索引 `personnel`
--
ALTER TABLE `personnel`
  ADD PRIMARY KEY (`country`);

--
-- 表的索引 `team`
--
ALTER TABLE `team`
  ADD PRIMARY KEY (`stu_number`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `password_reset_token` (`password_reset_token`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `help`
--
ALTER TABLE `help`
  MODIFY `hid` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增列', AUTO_INCREMENT=23;

--
-- 使用表AUTO_INCREMENT `important`
--
ALTER TABLE `important`
  MODIFY `tid` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增列', AUTO_INCREMENT=184;

--
-- 使用表AUTO_INCREMENT `news`
--
ALTER TABLE `news`
  MODIFY `nid` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增列', AUTO_INCREMENT=21;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
